/* This query fills all tables in DB with some values */

USE MobileOperator_by_DmitryBalabanov;

INSERT INTO HomeAddress (adr_id, adr_region, adr_city, adr_locality, adr_street, adr_home, adr_apartment, add_post_index)
VALUES
	(1, 'Московская область', 'Одинцово', 'Сколково', 'ул. Новая', 'д. 1', 'кв. 1', '143001'),
	(2, 'Москва', 'Москва', 'Басманный', 'ул. Никольная', 'д. 10', 'кв. 5', '125009'),
	(3, 'Санкт-Петербург', 'Санкт-Петербург', 'Красногвардейский', 'ул. Пролетарская', 'д. 5', 'кв. 10', '190013'),
	(4, 'Краснодарский край', 'Краснодар', 'Краснодар', 'ул. Красная', 'д. 25', 'кв. 7', '350000'),
	(5, 'Самарская область', 'Самара', 'Самара', 'ул. Советская', 'д. 7', 'кв. 13', '443010'),
	(6, 'Республика Татарстан', 'Казань', 'Ново-Савиновский', 'ул. Льва Толстого', 'д. 15', 'кв. 3', '420021'),
	(7, 'Ростовская область', 'Ростов-на-Дону', 'Ростов-на-Дону', 'ул. Ленина', 'д. 12', 'кв. 8', '344011'),
	(8, 'Новосибирская область', 'Новосибирск', 'Новосибирск', 'ул. Лермонтова', 'д. 3', 'кв. 4', '630017'),
	(9, 'Республика Башкортостан', 'Уфа', 'Орджоникидзевский', 'ул. Менделеева', 'д. 20', 'кв. 12', '450001'),
	(10, 'Красноярский край', 'Красноярск', 'Красноярск', 'ул. Свердлова', 'д. 8', 'кв. 2', '660017');


INSERT INTO Passport (ppt_series_number, ppt_issued_by, ppt_issued_date, ppt_division_code, ppt_date_of_birth, ppt_address, ppt_gender)
VALUES
	('AB123456', 'МВД РФ', '2020-01-01', '123-456', '1995-01-01', 1, 'M'),
	('CD123456', 'МВД РФ', '2020-02-01', '456-789', '1990-01-02', 2, 'M'),
	('EF123456', 'МВД РФ', '2020-03-01', '789-012', '1985-01-03', 3, 'F'),
	('GH123456', 'МВД РФ', '2020-04-01', '012-345', '1980-01-04', 4, 'M'),
	('IJ123456', 'МВД РФ', '2020-05-01', '345-678', '1975-01-05', 5, 'F'),
	('KL123456', 'МВД РФ', '2020-06-01', '678-901', '1970-01-06', 6, 'M'),
	('MN123456', 'МВД РФ', '2020-07-01', '901-234', '1965-01-07', 7, 'F'),
	('OP123456', 'МВД РФ', '2020-08-01', '234-567', '1960-01-08', 8, 'M'),
	('QR123456', 'МВД РФ', '2020-09-01', '567-890', '1955-01-09', 9, 'F'),
	('ST123456', 'МВД РФ', '2020-10-01', '890-123', '1950-01-10', 10, 'M');

INSERT INTO [Subscriber] VALUES ('Голый Андрей Иванович', '2398', '129833', '2023/01/06', 3);
INSERT INTO [Subscriber] VALUES ('Гаражный Денис Витальевич', '8567', '897644', '2022/12/29', 2);
INSERT INTO [Subscriber] VALUES ('Ровный Анатолий Петрович', '7891', '456789', '2022/11/30', 1);
INSERT INTO [Subscriber] VALUES ('Котов Иван Степанович', '6543', '123456', '2022/11/01', 2);
INSERT INTO [Subscriber] VALUES ('Пыхтеловский Геннадий Андреевич', '2847', '237569', '2023/02/14', 1);
INSERT INTO [Subscriber] VALUES ('Збзызина Елена Эдуардовна', '9677', '974125', '2023/01/20', 3);
INSERT INTO [Subscriber] VALUES ('Брысь Петр Евгеньвич', '3456', '789321', '2022/10/15', 2);
INSERT INTO [Subscriber] VALUES ('Женатая Виктория Дмитриевна', '5678', '654123', '2022/12/01', 1);
INSERT INTO [Subscriber] VALUES ('Безударный Владимир Николаевич', '1234', '789456', '2022/10/31', 3);
INSERT INTO [Subscriber] VALUES ('Калинкин-Малинкин Матвей Витальевич', '9876', '654987', '2023/03/14', 1);